Tekla Open API Reference for Tekla Structures 2025
Position Properties
The Position type exposes the following members.
Properties
Name | Description
Depth
 Indicates the positioning in the depth sense.
DepthOffset
 The offset away from the Depth value.
Plane
 Indicates the positioning in the plane sense.
PlaneOffset
 The offset away from the Plane value.
Rotation
 Indicates the positioning in the rotational sense.
RotationOffset
 The offset away from the Rotation value.
Top
See Also
Reference
Position Class
Tekla.Structures.Model Namespace